In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df_pob = pd.read_csv('/home/jumar/Desktop/data_analisys/datasets/poblacion.csv')
df_pob

In [ ]:
pd.options.display.float_format = "{:,.1f}".format

In [6]:
df_pob.dtypes

Country     object
year         int64
pop        float64
dtype: object

In [8]:
df_pob['year'] = pd.Categorical(df_pob['year'].apply(str))
df_pob.dtypes

Country      object
year       category
pop         float64
dtype: object

In [10]:
idx_filter = df_pob['Country'].isin(['Aruba', 'Colombia'])
idx_filter

0       False
1       False
2       False
3       False
4       False
        ...
1035    False
1036    False
1037    False
1038    False
1039    False
Name: Country, Length: 1040, dtype: bool

In [11]:
df_sample = df_pob[idx_filter]
df_sample

      Country  year          pop
9       Aruba  2015    104,341.0
42   Colombia  2015 47,520,667.0
269     Aruba  2016    104,872.0
302  Colombia  2016 48,171,392.0
529     Aruba  2017    105,366.0
562  Colombia  2017 48,901,066.0
789     Aruba  2018    105,845.0
822  Colombia  2018 49,648,685.0

In [13]:
df_sample.shape, df_pob.shape

((8, 3), (1040, 3))

In [25]:
df_sample = df_sample.set_index(['Country', 'year']).sort_index()
df_sample

                       pop
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [30]:
df_sample.loc['Colombia',:].loc['2015', :]

pop   47,520,667.0
Name: 2015, dtype: float64

In [34]:
df_sample.xs(('Aruba', '2016'))

pop   104,872.0
Name: (Aruba, 2016), dtype: float64

In [37]:
df_sample.xs('2016', level='year')

                  pop
Country
Aruba       104,872.0
Colombia 48,171,392.0

In [38]:
df_countries = df_pob.set_index(['Country', 'year']).sort_index(ascending=[True, True])
df_countries

                          pop
Country     year
Afghanistan 2015 34,413,603.0
            2016 35,383,128.0
            2017 36,296,400.0
            2018 37,172,386.0
Albania     2015  2,880,703.0
...                       ...
Zambia      2018 17,351,822.0
Zimbabwe    2015 13,814,629.0
            2016 14,030,390.0
            2017 14,236,745.0
            2018 14,439,018.0

[1040 rows x 1 columns]

In [39]:
ids = pd.IndexSlice
df_countries.loc[ids['Aruba':'Colombia', '2015':'2017'], :].sort_index()

                           pop
Country   year
Aruba     2015       104,341.0
          2016       104,872.0
          2017       105,366.0
Australia 2015    23,815,995.0
          2016    24,190,907.0
...                        ...
China     2016 1,378,665,000.0
          2017 1,386,395,000.0
Colombia  2015    47,520,667.0
          2016    48,171,392.0
          2017    48,901,066.0

[108 rows x 1 columns]

In [42]:
df_countries.index.get_level_values(1)

CategoricalIndex(['2015', '2016', '2017', '2018', '2015', '2016', '2017',
                  '2018', '2015', '2016',
                  ...
                  '2017', '2018', '2015', '2016', '2017', '2018', '2015',
                  '2016', '2017', '2018'],
                 categories=['2015', '2016', '2017', '2018'], ordered=False, dtype='category', name='year', length=1040)

In [45]:
df_countries['pop']['Colombia']['2018']

49648685.0

In [49]:
df_countries.groupby(level=1).sum()

                  pop
year
2015 65,679,147,019.0
2016 66,487,930,677.0
2017 67,294,176,701.0
2018 68,087,886,692.0

In [50]:
df_sample.unstack('year')

                  pop
year             2015         2016         2017         2018
Country
Aruba       104,341.0    104,872.0    105,366.0    105,845.0
Colombia 47,520,667.0 48,171,392.0 48,901,066.0 49,648,685.0

In [51]:
df_sample.unstack('Country')

              pop
Country     Aruba     Colombia
year
2015    104,341.0 47,520,667.0
2016    104,872.0 48,171,392.0
2017    105,366.0 48,901,066.0
2018    105,845.0 49,648,685.0

In [53]:
df_countries.unstack('year')

                               pop
year                          2015         2016         2017         2018
Country
Afghanistan           34,413,603.0 35,383,128.0 36,296,400.0 37,172,386.0
Albania                2,880,703.0  2,876,101.0  2,873,457.0  2,866,376.0
Algeria               39,728,025.0 40,551,404.0 41,389,198.0 42,228,429.0
American Samoa            55,812.0     55,741.0     55,620.0     55,465.0
Andorra                   78,011.0     77,297.0     77,001.0     77,006.0
...                            ...          ...          ...          ...
Virgin Islands (U.S.)    107,710.0    107,510.0    107,268.0    106,977.0
West Bank and Gaza     4,270,092.0  4,367,088.0  4,454,805.0  4,569,087.0
Yemen, Rep.           26,497,889.0 27,168,210.0 27,834,821.0 28,498,687.0
Zambia                15,879,361.0 16,363,507.0 16,853,688.0 17,351,822.0
Zimbabwe              13,814,629.0 14,030,390.0 14,236,745.0 14,439,018.0

[260 rows x 4 columns]